# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и
# Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
num_cranes=int(input("Напишите сколько жулавликов сделанно: "))
num_cranes//=6
print(f"Петя сделал журавликов: {num_cranes}")
print(f"Катя сделал журавликов: {num_cranes}")
print(f"Катя сделала журавликов: {num_cranes*4}")
